vkofman56/ESP32S3_video/hx-esp32-cam-fpv/components/esp32-camera/sensors/ov5640.c
    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
        sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;
    framesize_t old_framesize = sensor->status.framesize;
    sensor->status.framesize = framesize;

    if(framesize > FRAMESIZE_QSXGA){
        ESP_LOGE(TAG, "Invalid framesize: %u", framesize);
        return -1;
    }
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    aspect_ratio_t ratio = resolution[framesize].aspect_ratio;
    ratio_settings_t settings = ratio_table[ratio];

    sensor->status.binning = (w <= (settings.max_width / 2) && h <= (settings.max_height / 2));
    sensor->status.scale = !((w == settings.max_width && h == settings.max_height)
        || (w == (settings.max_width / 2) && h == (settings.max_height / 2)));

    ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, settings.start_x, settings.start_y)
        || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, settings.end_x, settings.end_y)
        || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h);

    if (ret) {
        goto fail;
    }

    if (!sensor->status.binning) {
        ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, settings.total_y)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x, settings.offset_y);
    } else {
        if (w > 920) {
            ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x - 200, settings.total_y / 2);
        } else {
            ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 2060, settings.total_y / 2);
        }
        if (ret == 0) {
            ret = write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x / 2, settings.offset_y / 2);
        }
    }

    if (ret == 0) {
        ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x20, sensor->status.scale);
    }

    if (ret == 0) {
        ret = set_image_options(sensor);
    }

    if (ret) {
        goto fail;
    }

    if (sensor->pixformat == PIXFORMAT_JPEG) {
#ifdef CONFIG_IDF_TARGET_ESP32S3
        /*
        //10MHz PCLK
        uint8_t sys_mul = 200;
        if(framesize < FRAMESIZE_QVGA || sensor->xclk_freq_hz == 16000000){
            sys_mul = 160;
        } else if(framesize < FRAMESIZE_XGA){
            sys_mul = 180;
        }
        ret = set_pll(sensor, false, sys_mul, 4, 2, false, 2, true, 4);
        Set PLL: bypass: 0, multiplier: sys_mul, sys_div: 4, pre_div: 2, root_2x: 0, pclk_root_div: 2, pclk_manual: 1, pclk_div: 4
        */

        //https://patchwork.kernel.org/project/linux-media/patch/20181113130325.28975-2-maxime.ripard@bootlin.com/

        //for XLCK=20Mhz
        if (framesize == FRAMESIZE_SVGA ) //800x600
        {
            //ret = set_pll(sensor, false, 30, 1, 1, false, 3, true, 3); //10 mhz pclk
            ret = set_pll(sensor, false, 30, 1, 1, false, 2, true, 3); //20 mhz pclk
        }
        else if (framesize == FRAMESIZE_P_HD) //800x456
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 23, 1, 1, false, 2, true, 3); //15.3 mhz pclk
            }
            else
            {
                ret = set_pll(sensor, false, 40, 1, 1, false, 2, true, 4); //20 mhz pclk
            }
        }
        else if (framesize == FRAMESIZE_VGA) //640x480
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 30, 1, 1, false, 2, true, 3); //20 mhz pclk
            }
            else
            {
                ret = set_pll(sensor, false, 40, 1, 1, false, 2, true, 4); 
            }
        }
        else if (framesize == FRAMESIZE_P_3MP) //640x360
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 23, 1, 1, false, 2, true, 3); //15.3 mhz pclk
                //ret = set_pll(sensor, false, 5, 1, 1, false, 2, true, 3);
            }
            else
            {
                ret = set_pll(sensor, false, 40, 1, 1, false, 2, true, 4); //20 mhz pclk
            }
        }
        else if (framesize == FRAMESIZE_XGA)  //1024x768 
        {
            ret = set_pll(sensor, false, 39, 1, 1, false, 2, true, 5); //15.3 mhz pclk 
        }
        else if (framesize == FRAMESIZE_P_FHD)  //1024x576 
        {
            ret = set_pll(sensor, false, 29, 1, 1, false, 2, true, 3);  //19.3 mhz pclk
        }
        else if (framesize == FRAMESIZE_SXGA)  //1280x960
        {
            ret = set_pll(sensor, false, 39, 1, 1, false, 2, true, 5); //15.6 mhz pclk
        }
        else if (framesize == FRAMESIZE_HD)  //1280x720 //19.3 mhz pclk
        {
            ret = set_pll(sensor, false, 29, 1, 1, false, 2, true, 3); 
        }
        else 
        {
            //ret = set_pll(sensor, false, 19, 1, 1, false, 3, true, 4); 
            ret = set_pll(sensor, false, 19, 1, 1, false, 2, true, 3); 
        }
#else
        //10MHz PCLK
        uint8_t sys_mul = 200;
        if(framesize < FRAMESIZE_QVGA || sensor->xclk_freq_hz == 16000000){
            sys_mul = 160;
        } else if(framesize < FRAMESIZE_XGA){
            sys_mul = 180;
        }
        ret = set_pll(sensor, false, sys_mul, 4, 2, false, 2, true, 4);
        //Set PLL: bypass: 0, multiplier: sys_mul, sys_div: 4, pre_div: 2, root_2x: 0, pclk_root_div: 2, pclk_manual: 1, pclk_div: 4
#endif        
    } else {
        //ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        if (framesize > FRAMESIZE_HVGA) {
            ret = set_pll(sensor, false, 10, 1, 2, false, 1, true, 2);
        } else if (framesize >= FRAMESIZE_QVGA) {
            ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        } else {
            ret = set_pll(sensor, false, 20, 1, 1, false, 1, true, 8);
        }
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return ret;

